# 02 - Summarising segments
Often when we are doing analytics, we need to segment our data and summarise those segments so they can be compared and decisions can be made. For example, to help us decide which segment to target for a marketing campaign.

In these exercises we are going to explore some segments of the listings data and create some stats for each segement. Let's first import `pandas` and load the listings data.

In [9]:
import pandas as pd
df_listings = pd.read_csv('../data/wk3_listings_sample.csv')

## Neighborhood segments
As a first example, let's assume we want to see how many listings in the dataset are based in each neighbourhood in the dataset.

Using tools from before, we can do this quite simply using the `value_counts()` function. Run the code below.

In [10]:
df_listings['neighbourhood_cleansed'].value_counts().head()

Westminster               3359
Tower Hamlets             2603
Hackney                   2254
Kensington and Chelsea    2175
Camden                    2065
Name: neighbourhood_cleansed, dtype: int64

**Question:** Which neighbourhood in the dataset has the most listings in the dataset? Westminster

### Exercise-01: Number of listings

If we wanted to do this a bit more cleanly, and create a new `DataFrame` showing each neighborhood and the number of listings in each neighbourhood, then we would run code like shown below.

In [11]:
df_neighborhood_counts = df_listings['neighbourhood_cleansed'].value_counts().reset_index()
df_neighborhood_counts.columns = ['neighbourhood_cleansed','number_of_listings']
df_neighborhood_counts.head()
df_neighborhood_counts.sort_values(by='number_of_listings', ascending=False)

    neighbourhood_cleansed  number_of_listings
0              Westminster                3359
1            Tower Hamlets                2603
2                  Hackney                2254
3   Kensington and Chelsea                2175
4                   Camden                2065
5                Islington                1731
6                  Lambeth                1701
7                Southwark                1661
8               Wandsworth                1474
9   Hammersmith and Fulham                1364
10                   Brent                 932
11                Lewisham                 848
12                Haringey                 838
13                  Newham                 722
14                  Ealing                 650
15                  Barnet                 648
16               Greenwich                 605
17          Waltham Forest                 524
18                  Merton                 479
19    Richmond upon Thames                 452
20                 Croydon                 435
21                Hounslow                 401
22               Redbridge                 288
23              Hillingdon                 259
24    Kingston upon Thames                 236
25                 Bromley                 236
26                 Enfield                 226
27                  Harrow                 187
28          City of London                 158
29    Barking and Dagenham                 157
30                  Bexley                 115
31                  Sutton                 114
32                Havering                 103

### Exercise-02: Least listings
If we have a `DataFrame` containing the number of listings for each neighbourhood, then we can easily identify the neighbourhood which the least listings. Sort the rows in `df_neighborhood_counts` by the values in `number_of_listings` to identify the neighbourhood in the dataset with the least number of listings in the dataset.

In [12]:
# (SOLUTION)
df_neighborhood_counts.sort_values(by='number_of_listings').head()

   neighbourhood_cleansed  number_of_listings
32               Havering                 103
31                 Sutton                 114
30                 Bexley                 115
29   Barking and Dagenham                 157
28         City of London                 158

**Question:** Which neighbourhood in the dataset has the least number of listings in the dataset?

## Neighbourhood-level aggregates
We are now going to explore a new (more extensible) way to compute statistics for for each segment (e.g. neighbourhood) in a dataset. First, let's count the number of listings in each neighbourhood using a different approach to the one used in Exercise-01 (i.e. without using the `value_counts()` method).

### Exercise-03: Count listings
To create a `DataFrame` containing the number of listings for each neighbourhood, without using the `value_counts()` function, we need to:
1. Use the `groupby` method to group the rows of `df_listings` by `neighbourhood_cleansed`.
2. Then use the `agg` method and `count` function to count the number of rows in each group.
3. Then clean-up the columns names of resulting `DataFrame`.
4. Finally, sort the rows of the resulting `DataFrame` and show its `head`.

In [13]:
df_listings_grouped = df_listings.groupby('neighbourhood_cleansed')
df_listings_aggregated = df_listings_grouped['id'].agg(['count']).reset_index()
df_listings_aggregated = df_listings_aggregated.rename(columns={'count': 'number_of_listings'})
df_listings_aggregated.sort_values(by='number_of_listings', ascending=False).head()

    neighbourhood_cleansed  number_of_listings
32             Westminster                3359
29           Tower Hamlets                2603
11                 Hackney                2254
19  Kensington and Chelsea                2175
5                   Camden                2065

**Question:** Is `df_listings_aggregated` the same as `df_neighborhood_counts`?

### Exercise-04: Mean price
As stated, the method used in Exercise-03 is extendable to other, similar, analytics problems. For example, let's try to use the `groupby` and `agg` methods to estimate the mean price of listings within each neighbourhood.

First, let's format the `price` column in `df_listings` again! To do this, run the code below.

In [14]:
def format_price(price):
    return(float(price.replace('$','').replace(',','')))

# (SOLUTION)
df_listings['price_$'] = df_listings['price'].apply(format_price) 
df_listings[['price','price_$']].head()

     price  price_$
0  $128.00    128.0
1   $70.00     70.0
2   $39.00     39.0
3   $85.00     85.0
4   $40.00     40.0

**Question:** What might you do to avoid having to format the price column repeatability?

Great! If we have formated the `price` column correctly, we will be able to calculate the mean price for each neighbourhood. Using Pandas, we will do this in three steps:

1. Use the `groupby` method to group the rows of `df_listings` by `neighbourhood_cleansed`.
2. Then use the `agg` method and `mean` function to calculate the mean `price_$` for each group.
3. Then clean-up the columns names of resulting `DataFrame`.
4. Finally, sort the rows of the resulting `DataFrame` and show its `head`.

In [29]:
df_listings_grouped = df_listings.groupby('neighbourhood_cleansed')
df_listings_aggregated = df_listings_grouped['price_$'].agg(['mean']).reset_index()
df_listings_aggregated = df_listings_aggregated.rename(columns={'mean': 'mean_price_$'})
df_listings_aggregated.sort_values(by='mean_price_$', ascending=False).head()

    neighbourhood_cleansed  mean_price_$
6           City of London    201.936709
32             Westminster    185.473355
19  Kensington and Chelsea    183.262529
5                   Camden    138.333172
18               Islington    132.304448

**Question:** Which neighbourhood has the highest `mean_price_$`?

### Exercise-05: Mean price per person
Use what you have learned here and in notebook `Exercise-02` of notebook `01 - Calculating metrics` to estimate the mean `price_$/person` for each neighbourhood.

In [45]:
# (SOLUTION)
df_listings['price_$/person'] = df_listings['price_$'] / df_listings['accommodates']
df_listings[['price_$','accommodates','price_$/person']].head()

df_listings_grouped = df_listings.groupby('neighbourhood_cleansed')
df_listings_aggregated = df_listings_grouped['price_$/person'].agg(['mean']).reset_index()
df_listings_aggregated = df_listings_aggregated.rename(columns={'mean': 'mean_price_$/person'})
df_listings_aggregated.sort_values(by='mean_price_$/person', ascending=False)

    neighbourhood_cleansed  mean_price_$/person
6           City of London            65.122416
32             Westminster            58.785600
19  Kensington and Chelsea            53.564056
5                   Camden            46.914179
1                   Barnet            46.874510
18               Islington            46.339959
13                Haringey            42.006290
12  Hammersmith and Fulham            40.677795
8                   Ealing            39.883759
3                    Brent            39.061191
26    Richmond upon Thames            38.634126
23                  Merton            37.481630
27               Southwark            37.475521
24                  Newham            35.575412
29           Tower Hamlets            35.429820
31              Wandsworth            34.583242
11                 Hackney            34.072383
4                  Bromley            32.406938
21                 Lambeth            31.887685
9                  Enfield            31.047200
20    Kingston upon Thames            30.901643
17                Hounslow            30.875851
14                  Harrow            30.577317
10               Greenwich            30.180270
28                  Sutton            29.517043
16              Hillingdon            28.687270
22                Lewisham            28.190398
25               Redbridge            27.907612
0     Barking and Dagenham            27.773797
15                Havering            27.373544
30          Waltham Forest            25.055955
7                  Croydon            23.893377
2                   Bexley            23.366636

### Exercise-06: Sum of forecast income
Use what you have learned here and in notebook `Exercise-03` of notebook `01 - Calculating metrics` to forecast the total income over the next 30 days (e.g. `estimated_income_30`) for each neighbourhood.

*Hint*: You will need to use `sum` as the function used to aggregate, rather than `mean`.

In [44]:
# (SOLUTION)
df_listings['estimated_income_30'] = df_listings['price_$'] * (30 - df_listings['availability_30'])
df_listings[['price_$','availability_30', 'estimated_income_30']].head()

df_listings_grouped = df_listings.groupby('neighbourhood_cleansed')
df_listings_aggregated = df_listings_grouped['estimated_income_30'].agg(['sum']).reset_index()
df_listings_aggregated = df_listings_aggregated.rename(columns={'sum': 'estimated_income_30_neigh'})
df_listings_aggregated.sort_values(by='estimated_income_30_neigh', ascending=False)

    neighbourhood_cleansed  estimated_income_30_neigh
32             Westminster                  8939947.0
19  Kensington and Chelsea                  7007601.0
5                   Camden                  5173650.0
29           Tower Hamlets                  4852258.0
11                 Hackney                  4608780.0
18               Islington                  4563364.0
31              Wandsworth                  3609843.0
12  Hammersmith and Fulham                  3491372.0
27               Southwark                  3327659.0
21                 Lambeth                  3110411.0
3                    Brent                  1722122.0
13                Haringey                  1573649.0
22                Lewisham                  1276531.0
26    Richmond upon Thames                  1203997.0
24                  Newham                  1198653.0
1                   Barnet                  1188768.0
23                  Merton                  1061209.0
8                   Ealing                   972695.0
10               Greenwich                   833449.0
30          Waltham Forest                   693736.0
17                Hounslow                   583405.0
7                  Croydon                   414081.0
4                  Bromley                   389943.0
20    Kingston upon Thames                   373672.0
6           City of London                   335664.0
25               Redbridge                   304685.0
9                  Enfield                   242594.0
16              Hillingdon                   233489.0
14                  Harrow                   185279.0
0     Barking and Dagenham                   146494.0
15                Havering                   111738.0
28                  Sutton                   108675.0
2                   Bexley                    96818.0

## Bonus exercises
Some bonus exercises!

### Exercise-07: Even more extensible code
We can write the code in `Exercise-04` in an *even more* extensible way.

In [10]:
group_col = 'neighbourhood_cleansed'
agg_col = 'price_$'
agg_func = 'mean'

df_listings_grouped = df_listings.groupby(group_col)
df_aggregated = df_listings_grouped[agg_col].agg([agg_func]).reset_index()
df_aggregated = df_aggregated.rename(columns={agg_func: f'{agg_func}_{agg_col}'})
df_aggregated.head()

  neighbourhood_cleansed  mean_price_$
0   Barking and Dagenham     57.662420
1                 Barnet     99.901235
2                 Bexley     56.165217
3                  Brent    101.111588
4                Bromley     83.211864

Here we have remove specifications out from the main code. Play around with other types of groupings and aggregations.

### Exercise-08: Data cleaning
Did you notice that we've been using the values in `neighbourhood_cleansed` to compute the neighbourhood of each listing? What do you think `cleansed` means? Are you able to find the answer in the [data dictionary](https://docs.google.com/spreadsheets/d/1iWCNJcSutYqpULSQHlNyGInUvHg2BoUGoNRIGa6Szc4/edit#gid=982310896)? Why do you think we didn't use that values in in `neighbourhood`?